{
  "cars": [
    {
      "name": "Porsche 911",
      "class": "Sports Car",
      "description": "The Porsche 911 is a true icon in the sports car world, known for its sleek design, impressive performance, and superior handling. It's a two-door, two-seat coupe that's perfect for those who love to feel the wind in their hair and the road beneath their wheels.",
      "seats": 2,
      "luggage": 2,
      "image": "https://files.porsche.com/filestore/image/multimedia/none/992-c4-gts-modelimage-sideshot/thumbwhite/7315cc10-d3f3-11eb-80d9-005056bbdc38;sI;twebp/porsche-thumbwhite.webp"
    },
    {
      "name": "BMW 7 Series",
      "class": "Luxury Car",
      "description": "The BMW 7 Series is the ultimate luxury car, offering unparalleled comfort, style, and technology. With its sleek exterior and spacious interior, this four-door sedan is perfect for those who demand the very best in automotive design and performance.",
      "seats": 5,
      "luggage": 3,
      "image": "https://www.bmw-egypt.com/content/dam/bmw/common/all-models/7-series/sedan/2022/navigation/bmw-7-series-sedan-modelfinder.png"
    },
    {
      "name": "Range Rover Sport",
      "class": "SUV",
      "description": "The Range Rover Sport is a versatile SUV that's perfect for both on and off-road adventures. With its powerful engine and advanced four-wheel drive system, this vehicle can handle any terrain with ease. It's also incredibly spacious, with room for up to seven passengers and plenty of cargo space.",
      "seats": 7,
      "luggage": 4,
      "image": "https://imgd.aeplcdn.com/0x0/n/cw/ec/122451/range-rover-sport-exterior-right-front-three-quarter-2.jpeg?isig=0"
    },
    {
      "name": "Mercedes-Benz S-Class",
      "class": "Luxury Car",
      "description": "The Mercedes-Benz S-Class is the epitome of luxury and style, with its sleek lines and advanced technology. It's a four-door sedan that's perfect for those who demand the very best in automotive design and performance.",
      "seats": 5,
      "luggage": 2,
      "image": "https://www.freepnglogos.com/uploads/mercedes-png/download-mercedes-benz-png-pic-transparent-png-28.png"
    },
    {
      "name": "Tesla Model S",
      "class": "Electric Car",
      "description": "The Tesla Model S is a high-performance electric car that's perfect for those who want to combine luxury with sustainability. With its sleek design and advanced technology, this four-door sedan offers a smooth and quiet ride. It also has plenty of space for passengers and luggage.",
      "seats": 5,
      "luggage": 2,
      "image": "https://www.evrent.co.uk/wp-content/uploads/2021/06/195-1956528_tesla-model-s-png.png"
    },
    {
      "name": "Bentley Bentayga",
      "class": "Luxury SUV",
      "description": "The Bentley Bentayga is the ultimate luxury SUV, offering unparalleled comfort, style, and performance. With its powerful engine and advanced technology, this vehicle can handle any terrain with ease. It's also incredibly spacious, with room for up to seven passengers and plenty of cargo space.",
      "seats": 7,
      "luggage": 4,
      "image": "https://www.kia.com/us/content/dam/kia/us/en/vehicles/sorento/2023/trims/s-fwd/exterior/878d9c/360/01.png/jcr:content/renditions/mobile.png"
    }
  ],
  "testimonials": [
    {
      "name": "John Moo",
      "description": "I recently bought a car through YourCar and I was blown away by their exceptional service. The staff were friendly and knowledgeable, and they helped me find the perfect car for my needs. I highly recommend YourCar to anyone looking for a luxury car buying experience."
    },
    {
      "name": "Ahmed Osama",
      "description": "The Mercedes-Benz S-Class is the epitome of luxury and style, with its sleek lines and advanced technology. It's a four-door sedan that's perfect for those who demand the very best in automotive design and performance."
    },
    {
      "name": "Karim Saad",
      "description": "YourCar exceeded my expectations in every way. From the moment I walked in, I felt like a valued customer. The staff went above and beyond to ensure that I found the car of my dreams. I couldn't be happier with my purchase and I highly recommend YourCar to anyone in the market for a luxury vehicle."
    },
    {
      "name": "Sarah Ahmed",
      "description": "YourCar made selling my car a breeze. They handled all the paperwork and negotiations, and I received a fair price for my vehicle. I would definitely use their services again in the future."
    },
    {
      "name": "Michael Khalil",
      "description": "I had a wonderful experience renting a car from YourCar. The car was in excellent condition and the pickup and drop-off process was seamless. I highly recommend them for anyone in need of a luxury car rental."
    },
    {
      "name": "Emily Han",
      "description": "YourCar exceeded my expectations in every way. From the moment I walked in, I felt like a valued customer. The staff went above and beyond to ensure that I found the car of my dreams. I couldn't be happier with my purchase and I highly recommend YourCar to anyone in the market for a luxury vehicle."
    }
  ]
}
